import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# 2017년 기준
crime_sort=['강력범죄','절도범죄','폭력범죄','지능범죄','풍속범죄','특별경제범죄','마약범죄','보건범죄','환경범죄','교통범죄']
crime_diff=[-35, 113, 152, 750, 18, 178, -60, 37, 3, -3107]
cctv=[2565,2565,2565,2565,2565,2565,2565,2565,2565,2565]
bell=[1733,1733,1733,1733,1733,1733,1733,1733,1733,1733]
policeman=[539,539,539,539,539,539,539,539,539,539]


#        cctv bell 경찰관 강력범죄 감소
# 수원시  100  50  10       5
# 안양시  90   44  15       3
# 평택시  105  98  20       7

d1=[100, 90, 105]
d2=[50, 44, 98]
d3=[10,15,20]
d4=[5,3,7]

data=pd.DataFrame({'cctv':d1,'bell':d2,'policeman':d3,'crime':d4},index=['수원시','안양시','평택시'])
print(data)
print(data.corr(method='pearson'))

# cctv/bell/경찰관 수가 강력범죄 예방에 미치는 영향도 
# cctv 1등 , bell 2등, 경찰관 3등

# 수원시의 범죄종류별 상관관계 분석
# 수원시의 top5 범죄종류
# top5 범죄간의 상관관계 분석
#      강력, 절도, 폭력
# 강력   0.1  0.1  0.5 = 0.7
# 절도  0.4   -0.1 0.1 = 0.4
# 폭력  0.4   0.3  -0.2 = 0.5
# 강력범죄 예방에 효과가 가장 큰 것은 cctv였으므로 수원시에는 cctv 추가 증설을 통한 강력, 절도, 폭력범죄 감소 효과 추천

crime_type=['강력범죄','절도범죄','폭력범죄','지능범죄','풍속범죄','특별경제범죄','마약범죄','보건범죄','환경범죄','교통범죄','노동범죄','안보범죄','선거범죄','병역범죄', '기타범죄']
year2017=[672, 5494, 7919, 7973, 595, 1133, 158, 318, 32, 14266, 109, 0, 24, 376, 6922]
year2018=[637, 5381, 8071, 8723, 613, 1311, 98, 355, 35, 11159, 39, 1, 24, 354, 5322]
year2019=[629, 5180, 7871, 10117, 743, 1324, 137, 289, 40, 9810, 10, 0, 3, 348, 5196]
year2020=[620, 4868, 7016, 10413, 1860, 1134, 176, 331, 14, 8826, 3, 2, 8, 68, 5320]

# 수원시는 강력범죄가 증가하면 절도범죄가 0.84, 교통범죄 0.99 증가 ==> 강력범죄가 감소하면 절도범죄, 교통범죄도 같이 감소한다
# 그런데 강력범죄를 예방하는것은 cctv가 가장 효과가 좋다
# 강력범죄 10개 줄었다, cctv 10개(10/10=1), bell (10/8=1.xx), 경찰관 3명(10/3=3.3)  ==> 경찰관이 가장 범죄예방 효과가 좋음 
# 수원시는 cctv를 증가시키면 강력범죄, 절도범죄, 교통범죄의 감소를 도모할 수 있다

data=pd.DataFrame({'2017':year2017, '2018':year2018,'2019':year2019,'2020':year2020})
data=data.transpose()
data.columns=crime_type
corr_result=data.corr(method='pearson')
print(data)
print(corr_result)

# sns.pairplot(data,hue='crime')
# plt.savefig('test.png')